const { text } = require("express");

const main_keyboard = [
    [
      {
        text: "Послуги для розробки веб-сайтів та веб-додатків 🌐",
      },
    ],
    [
      {
        text: "Послуги для розробки ботів та автоматизації 🤖",
      },
    ],
    [
      {
        text: "Розробка / оптимізація баз даних 📊",
      },
    ],
    [
      {
        text: "Розробка систем управління вмістом (CMS) та CRM 🖥️",
      },
    ],
    [
      {
        text: "Розробка та налаштування електронних платіжних систем 💳",
      },
    ],
    [
      {
        text: "Розробка мобільних додатків 📱",
      },
      {
        text: "SEO та онлайн-маркетинг 📈",
      },
    ],
    [
      { text: "🔔 Повідомлення мені 📩" },
      { text: "Хто Я ? 👨‍🦱" },
    ],
  ];
  

const admin_message_keyboard_first_step = [
    [
        {
          text: "❌ Повернутись назад",
        },
      ],
]
const admin_message_keyboard_last_step = [
    [
        {
          text: "Надіслати",
        },
      ],
    [
        {
          text: "❌ Повернутись назад",
        },
      ],
]

// ADMIN
const admin_main_keyboard = [
    [
      {
        text: "Адмін панель",
      },
    ],
    [
      {
        text: "Послуги для розробки веб-сайтів та веб-додатків 🌐",
      },
    ],
    [
      {
        text: "Послуги для розробки ботів та автоматизації 🤖",
      },
    ],
    [
      {
        text: "Розробка / оптимізація баз даних 📊",
      },
    ],
    [
      {
        text: "Розробка систем управління вмістом (CMS) та CRM 🖥️",
      },
    ],
    [
      {
        text: "Розробка та налаштування електронних платіжних систем 💳",
      },
    ],
    [
      {
        text: "Розробка мобільних додатків 📱",
      },
      {
        text: "SEO та онлайн-маркетинг 📈",
      },
    ],
    [
      { text: "🔔 Повідомлення мені 📩" },
      { text: "Хто Я ? 👨‍🦱" },
    ],
 
  ];
  
  const admin_menu_keyboard = [
    [{text:"К-сть користувачів бота"}
      
    ],
    [{text:"❓ Отримати нове повідомлення"}],
    [{text:"❌ Повернутись назад"}]
  ]

module.exports = {
  main_keyboard,
  admin_main_keyboard,
  admin_menu_keyboard,
  admin_message_keyboard_first_step,
  admin_message_keyboard_last_step
};
