const infoPagesShow = async (bot) =>{
    bot.hears('✅ Landing Page (Цільова сторінка)', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Landing Page (Цільова сторінка)</b>\n\n
          🌐 <b>Розробка односторінкових сайтів</b> для маркетингових кампаній, продуктів або послуг.\n
          📱 <b>Адаптивний дизайн</b> під мобільні пристрої.\n
          📊 <b>Інтеграція з аналітикою</b> (Google Analytics).\n
          📝 <b>Створення форм для збору контактних даних</b> (lead capture).\n
          ⚡ <b>Оптимізація швидкості</b> завантаження сторінки.\n
          <i>Це ідеальне рішення для ефективних рекламних кампаній та підвищення конверсій.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
      });
    bot.hears('✅ Багатосторінкові сайти', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Багатосторінкові сайти</b>\n\n
          🏢 <b>Розробка корпоративних сайтів</b> для компаній та організацій.\n
          📰 <b>Блоги та новинні портали</b> для створення власного медіа-простору.\n
          🛍️ <b>Сайти для онлайн-магазинів (E-commerce)</b> з інтеграцією платіжних систем.\n
          🔍 <b>Базова SEO-оптимізація</b> для пошукових систем, щоб вас знаходили.\n
          🛠️ <b>Інтеграція з системами управління контентом (CMS)</b>, такими як WordPress, Joomla, Drupal.\n
          🖥️ <b>Створення спеціалізованих панелей адміністрування</b> для управління контентом.\n
          <i>Ідеально підходить для корпоративних сайтів, блогів та новинних порталів.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
      });
      
      bot.hears('✅ Інтернет-магазини', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Інтернет-магазини</b>\n\n
          🏪 <b>Розробка магазинів на базі платформ</b> (Shopify, WooCommerce, Magento).\n
          💳 <b>Інтеграція з платіжними системами</b> (Stripe, PayPal, LiqPay, тощо).\n
          🛒 <b>Управління товарами</b> (категорії, фільтри, пошук).\n
          📱 <b>Мобільна версія магазину</b> та адаптивний дизайн.\n
          📦 <b>Інтеграція з системами управління складом</b> для автоматизації обліку товарів.\n
          <i>Ідеальне рішення для будь-якого онлайн-магазину, від малого до великого бізнесу.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
      });
      
      bot.hears('✅ Web-програмування і інтерфейси', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Web-програмування і інтерфейси</b>\n\n
          🖥️ <b>Розробка складних веб-додатків</b> з високими вимогами до функціональності.\n
          📈 <b>Спеціалізовані рішення для бізнесу</b> (CRM, ERP) для автоматизації процесів.\n
          💬 <b>Розробка інтерактивних елементів</b> (чати, калькулятори, інтерактивні мапи).\n
          ⚙️ <b>Використання фреймворків</b> (React, Angular, Vue.js) для швидкої та ефективної розробки.\n
          🔌 <b>Розробка API</b> для інтеграції з іншими системами та зовнішніми сервісами.\n
          <i>Підходить для створення складних рішень для бізнесу, інтерактивних веб-додатків і API-інтеграцій.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
      });
      bot.hears('✅ Розробка чат-ботів', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка чат-ботів</b>\n\n
          🤖 <b>Створення чат-ботів</b> для Telegram, Facebook Messenger, WhatsApp та інших платформ.\n
          🔄 <b>Інтеграція з різними системами</b> (CRM, ERP, служби підтримки).\n
          💬 <b>Налаштування автоматичних відповідей</b> та створення сценаріїв для бота.\n
          🧠 <b>Штучний інтелект</b> для аналізу запитів та навчання бота.\n
          📊 <b>Аналітика взаємодії</b> з користувачами для покращення обслуговування.\n
          <i>Чат-боти допомагають автоматизувати підтримку, продажі та комунікацію з користувачами.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Автоматизація процесів', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Автоматизація процесів</b>\n\n
          ⚙️ <b>Автоматизація бізнес-процесів</b> для управління завданнями, комунікацією та іншими процесами.\n
          📝 <b>Інтеграція з сервісами</b> для обробки даних, документів та автоматичного створення звітів.\n
          📅 <b>Створення планувальників</b>, календарів та автоматичних нагадувань.\n
          🛠️ <b>Інтеграція з платформами для автоматизації</b> (Zapier, Integromat).\n
          🧑‍💻 <b>Налаштування розсилок</b> та автоматичних повідомлень для комунікації з клієнтами.\n
          <i>Автоматизація процесів допоможе збільшити ефективність та зменшити людське втручання в рутинні задачі.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Інтеграція з іншими системами', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Інтеграція з іншими системами</b>\n\n
          🔗 <b>API інтеграція</b> з онлайн-сервісами та платформами для синхронізації даних.\n
          📥 <b>Збір даних</b> з веб-сайтів та інших джерел для автоматизації робочих процесів.\n
          🛠️ <b>Розробка кастомізованих API</b> для інтеграції з конкретними бізнес-процесами.\n
          💼 <b>Інтеграція з ERP, CRM системами</b> для покращення обміну даними між різними платформами.\n
          <i>Інтеграція дозволяє бізнесу працювати ефективніше, об'єднуючи різні сервіси та платформи.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Розробка системи підтримки', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка системи підтримки</b>\n\n
          📞 <b>Створення чат-ботів для підтримки клієнтів</b> для автоматизації відповіді на запитання та обробки звернень.\n
          🕒 <b>Автоматизація роботи з чеками</b>, замовленнями, відгуками та іншими запитами.\n
          💬 <b>Інтеграція з системами управління зверненнями</b> (ticketing systems) для покращення підтримки.\n
          🤖 <b>Чат-боти для FAQ</b> та обробки часто запитуваних питань для економії часу.\n
          <i>Розробка системи підтримки допоможе зменшити навантаження на персонал та швидше обробляти запити.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Розробка баз даних', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка баз даних</b>\n\n
          🏗️ <b>Проектування та створення баз даних</b> з урахуванням потреб вашого бізнесу.\n
          💾 <b>Вибір типів баз даних</b> (реляційні, NoSQL, графові, тощо) для вашого проекту.\n
          🔒 <b>Безпека даних</b> — створення механізмів захисту та резервного копіювання.\n
          ⚡ <b>Інтеграція з іншими системами</b> для забезпечення безперебійної роботи та доступу до даних.\n
          🛠️ <b>Налаштування адміністрування бази даних</b>, створення інтерфейсів для керування даними.\n
          <i>Розробка баз даних дозволяє структурувати ваші дані для легкого доступу та збереження важливої інформації.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Оптимізація баз даних', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Оптимізація баз даних</b>\n\n
          ⚙️ <b>Оптимізація запитів</b> для підвищення швидкості роботи бази даних.\n
          🔄 <b>Індексація даних</b> для прискорення доступу до великих обсягів інформації.\n
          🛠️ <b>Моніторинг та налаштування продуктивності</b> бази даних для запобігання затримкам та збоїв.\n
          💾 <b>Оптимізація резервного копіювання</b> для безпечного зберігання даних.\n
          🔒 <b>Поліпшення безпеки</b> — усунення уразливостей та налаштування доступу.\n
          <i>Оптимізація баз даних дозволяє значно підвищити ефективність і надійність вашої системи зберігання даних.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    

    bot.hears('✅ Розробка CMS', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка CMS (Системи Управління Контентом)</b>\n\n
          🖥️ <b>Створення кастомізованих CMS</b> для легкого управління контентом вашого сайту.\n
          💼 <b>Інтеграція з іншими системами</b>, такими як CRM, ERP, для покращення робочих процесів.\n
          🔧 <b>Розробка адаптивних інтерфейсів</b> для зручного управління контентом.\n
          🔒 <b>Забезпечення безпеки даних</b> та доступу до адміністративної частини системи.\n
          ⚙️ <b>Налаштування панелей адміністрування</b>, що дають змогу ефективно керувати контентом.\n
          <i>Ідеально підходить для компаній, які хочуть мати контроль над своїм веб-контентом без залучення розробників для кожної зміни.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    
    bot.hears('✅ Розробка CRM', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка CRM (Системи Управління Взаєминами з Клієнтами)</b>\n\n
          📊 <b>Створення кастомізованих CRM-систем</b> для управління клієнтами та продажами.\n
          🧑‍💼 <b>Інтеграція з іншими платформами</b> (наприклад, ERP, email-розсилки) для більш ефективної роботи.\n
          🔄 <b>Автоматизація процесів</b> для керування взаємодіями з клієнтами (виписки, нагадування, аналіз даних).\n
          🛠️ <b>Розробка користувацьких панелей</b> для зручного доступу до клієнтських даних і статистики.\n
          ⚙️ <b>Налаштування звітності</b> для моніторингу ефективності роботи з клієнтами та співробітниками.\n
          <i>CRM-система допомагає автоматизувати і контролювати роботу з клієнтами, підвищуючи ефективність і зменшуючи час на виконання рутинних завдань.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    
    bot.hears('✅ Розробка платіжних систем', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка платіжних систем</b>\n\n
          💳 <b>Інтеграція з популярними платіжними системами</b> (Stripe, PayPal, LiqPay, та іншими).\n
          🔒 <b>Забезпечення безпеки</b> транзакцій за допомогою сучасних стандартів шифрування.\n
          🛠️ <b>Налаштування платіжних шлюзів</b> для ефективного збору платежів в різних валютах.\n
          ⚙️ <b>Розробка кастомізованих рішень</b> для специфічних вимог вашого бізнесу.\n
          📊 <b>Аналітика та моніторинг транзакцій</b> для покращення фінансового контролю та звітності.\n
          <i>Це ідеальне рішення для бізнесів, які хочуть мати стабільну і безпечну платіжну інфраструктуру.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });

    bot.hears('✅ Налаштування платіжних систем для онлайн-магазинів', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Налаштування платіжних систем для онлайн-магазинів</b>\n\n
          🛒 <b>Інтеграція з платформами для електронної комерції</b> (Shopify, WooCommerce, Magento тощо).\n
          💳 <b>Підключення платіжних систем</b> для зручних та безпечних покупок (Stripe, PayPal, LiqPay, інші).\n
          🛠️ <b>Налаштування процесів оплати</b>, включаючи знижки, бонуси та промокоди для клієнтів.\n
          🔒 <b>Забезпечення безпеки</b> платіжних даних за допомогою SSL сертифікатів та інших заходів.\n
          📊 <b>Аналітика транзакцій</b> для контролю за процесами продажу та розрахунків.\n
          <i>Ідеально підходить для бізнесів, які прагнуть забезпечити безпечні та зручні способи оплати для своїх клієнтів.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Розробка мобільних додатків для Android', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка мобільних додатків для Android</b>\n\n
          📱 <b>Розробка високопродуктивних додатків</b> для Android-пристроїв на Kotlin чи Java.\n
          🔄 <b>Інтеграція з Google API</b> для доступу до сервісів Google (Карти, Google Pay тощо).\n
          ⚙️ <b>Налаштування push-повідомлень</b> для прямої взаємодії з користувачами.\n
          🔒 <b>Забезпечення безпеки даних</b> та шифрування для захисту користувачів.\n
          🖥️ <b>Оптимізація для різних версій Android</b> та забезпечення стабільної роботи на різних пристроях.\n
          <i>Ідеальне рішення для бізнесів, що хочуть охопити широку аудиторію користувачів Android-пристроїв.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Розробка мобільних додатків для iOS', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Розробка мобільних додатків для iOS</b>\n\n
          📱 <b>Розробка додатків для iPhone та iPad</b> на Swift або Objective-C.\n
          🔄 <b>Інтеграція з Apple API</b> для доступу до сервісів Apple (Apple Pay, iCloud, тощо).\n
          ⚙️ <b>Налаштування push-повідомлень</b> для залучення користувачів до додатка.\n
          🔒 <b>Забезпечення безпеки даних</b> для захисту конфіденційної інформації.\n
          🖥️ <b>Оптимізація додатка</b> для роботи на різних моделях iPhone та iPad.\n
          <i>Ідеальне рішення для бізнесів, що хочуть розробити преміум-продукти для користувачів iOS.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    
    bot.hears('✅ Кросплатформна розробка мобільних додатків', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Кросплатформна розробка мобільних додатків</b>\n\n
          🌍 <b>Розробка додатків для iOS та Android</b> за допомогою кросплатформних технологій (Flutter, React Native, Xamarin).\n
          ⚙️ <b>Інтеграція з API</b> для взаємодії з різними системами та сервісами.\n
          💬 <b>Підтримка push-повідомлень</b> для взаємодії з користувачами на обох платформах.\n
          🔒 <b>Забезпечення безпеки даних</b> на всіх платформах одночасно.\n
          🛠️ <b>Оптимізація продуктивності</b> для збереження високої швидкості додатка на обох платформах.\n
          <i>Ідеальний вибір для бізнесів, які хочуть розробити додаток, що працює на двох основних платформах без дублювання зусиль.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ SEO-оптимізація', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ SEO-оптимізація</b>\n\n
          🔍 <b>Оптимізація сайту для пошукових систем</b> для покращення видимості у Google, Bing, Yahoo.\n
          📊 <b>Аналіз і покращення ключових слів</b> для покращення пошукових результатів.\n
          🏗️ <b>Оптимізація внутрішньої структури сайту</b> для покращення навігації та швидкості завантаження.\n
          🔗 <b>Побудова беклінків</b> для підвищення авторитету сайту в очах пошукових систем.\n
          🖥️ <b>Аналіз конкурентів</b> для покращення позицій на ринку.\n
          <i>Покращуйте свою видимість в Інтернеті та залучайте більше органічного трафіку на сайт.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Контекстна реклама та PPC', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Контекстна реклама та PPC</b>\n\n
          📈 <b>Налаштування та оптимізація кампаній</b> в Google Ads та інших системах.\n
          💡 <b>Розробка ефективних рекламних оголошень</b> для залучення клієнтів.\n
          💸 <b>Моніторинг бюджету та ефективності кампаній</b> для максимізації ROI.\n
          🔍 <b>Аналіз ключових слів та аудиторії</b> для підвищення точності таргетингу.\n
          📊 <b>Оптимізація ставок і розподіл бюджету</b> для покращення результатів.\n
          <i>Залучайте більше потенційних клієнтів за допомогою ефективної контекстної реклами.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ Соціальні мережі та SMM', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ Соціальні мережі та SMM</b>\n\n
          📱 <b>Стратегія просування в соціальних мережах</b> для вашого бренду (Facebook, Instagram, LinkedIn, тощо).\n
          🖼️ <b>Розробка креативного контенту</b> (пости, відео, графіка) для залучення аудиторії.\n
          📈 <b>Аналіз і таргетування аудиторії</b> для досягнення кращих результатів.\n
          💬 <b>Управління репутацією бренду</b> в соціальних мережах та взаємодія з підписниками.\n
          📊 <b>Аналіз ефективності кампаній</b> за допомогою аналітики соціальних мереж.\n
          <i>Створіть потужну онлайн-присутність та збільшуйте свою аудиторію через соціальні мережі.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    bot.hears('✅ E-mail маркетинг та автоматизація', async (ctx) => {
        await ctx.replyWithHTML(
          `<b>✅ E-mail маркетинг та автоматизація</b>\n\n
          📧 <b>Розробка персоналізованих e-mail кампаній</b> для залучення та утримання клієнтів.\n
          🔄 <b>Автоматизація процесів розсилки</b> та налаштування тригерів для моментальної взаємодії з підписниками.\n
          📊 <b>Аналіз результатів розсилок</b> (відкриття листів, кліки, конверсії).\n
          🎯 <b>Таргетинг на основі поведінки користувачів</b> для підвищення ефективності кампаній.\n
          💬 <b>Створення автоматичних ланцюгів повідомлень</b> для максимального залучення та конверсії.\n
          <i>Підвищте ефективність вашого бізнесу за допомогою e-mail маркетингу та автоматизації.</i>`,
          {
            reply_markup: {
              keyboard: [
                [{ text: "❌ Повернутись назад" }],
                [{ text: "📨 Надіслати заявку?" }],
              ],
              resize_keyboard: true,
            },
          }
        );
    });
    

}

module.exports = infoPagesShow;